Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When running your application in OpenShift, you can use the link:https://docs.openshift.com/container-platform/4.16/security/certificates/service-serving-certificate.html[OpenShift serving certificates] to generate and renew TLS certificates automatically. The Quarkus TLS registry can use these certificates and Certificate Authority (CA) files to handle HTTPS traffic and securely validate certificates.
ja_jp: OpenShift でアプリケーションを実行する場合、 link:https://docs.openshift.com/container-platform/4.16/security/certificates/service-serving-certificate.html[OpenShift 提供証明書] を使用して、TLS 証明書を自動的に生成および更新できます。Quarkus TLS レジストリーは、この証明書と認証局 (CA) ファイルを使用して、HTTPS トラフィックを処理し、証明書をセキュアに検証できます。

source: When running your application in OpenShift, you can use the link:https://docs.openshift.com/container-platform/4.16/security/certificates/service-serving-certificate.html[OpenShift serving certificates] to generate and renew TLS certificates automatically. The Quarkus TLS registry can use these certificates and Certificate Authority (CA) files to handle HTTPS traffic and validate certificates securely.
ja_jp: OpenShift でアプリケーションを実行する場合、link:https://docs.openshift.com/container-platform/4.16/security/certificates/service-serving-certificate.html[OpenShift 提供証明書] を使用して、TLS 証明書を自動的に生成および更新できます。 Quarkus TLS レジストリーは、この証明書と認証局 (CA) ファイルを使用して、HTTPS トラフィックを処理し、証明書をセキュアに検証できます。

source: When second-level cache is disabled, all cache annotations are ignored and all queries are run ignoring caches; this is generally useful only to diagnose issues.
ja_jp: L2キャッシュを無効にすると、すべてのキャッシュアノテーションは無視され、すべてのクエリはキャッシュを無視して実行されます。これは通常、問題を診断する場合にのみ有効です。

source: When secure access is required and no other authentication mechanisms are enabled, xref:security-built-in-authentication.adoc#basic-auth[Quarkus built-in basic HTTP authentication] is the fallback authentication mechanism. Therefore, in this tutorial, you do not need to set the property `quarkus.http.auth.basic=true`.
ja_jp: 安全なアクセスが必要で、他の認証メカニズムが有効になっていない場合、 link:security-built-in-authentication.html#basic-auth[Quarkus に組み込まれた基本 HTTP 認証] が代替の認証メカニズムになります。したがって、このチュートリアルでは、プロパティ `quarkus.http.auth.basic=true` を設定する必要はありません。

source: When secure access is required, and no other authentication mechanisms are enabled, the built-in xref:security-basic-authentication.adoc[Basic authentication] of Quarkus is the fallback authentication mechanism. Therefore, in this tutorial, you do not need to set the property `quarkus.http.auth.basic` to `true`.
ja_jp: 安全なアクセスが必要で、他の認証メカニズムが有効になっていない場合、Quarkus に組み込まれている xref:security-basic-authentication.adoc[Basic 認証] がフォールバック認証メカニズムとなります。 したがって、このチュートリアルでは、プロパティー `quarkus.http.auth.basic` を `true` に設定する必要はありません。

source: When sending HTML emails, you can add inlined attachments. For example, you can send an image with your email, and this image will be displayed in the mail content. If you put the image file into the `META-INF/resources` folder, you should specify the full path to the file, _e.g._ `META-INF/resources/quarkus-logo.png` otherwise Quarkus will look for the file in the root directory.
ja_jp: HTMLメールを送信する際に、インラインで添付ファイルを追加することができます。例えば、メールに画像を添付して送信すると、その画像がメールの内容に表示されます。画像ファイルを `META-INF/resources` フォルダーに置く場合は、ファイルのフルパスを指定する必要があります。 _例えば_ 、 `META-INF/resources/quarkus-logo.png` です。そうしないと、Quarkusはルートディレクトリでファイルを探します。

source: When sending `Messages`, you can add an instance of `io.smallrye.reactive.messaging.pulsar.PulsarOutgoingMessageMetadata` to influence how the message is going to be written to Pulsar.
ja_jp: `Messages` を送信するときに `io.smallrye.reactive.messaging.pulsar.PulsarOutgoingMessageMetadata` のインスタンスを追加して、メッセージが Pulsar に書き込まれる方法に影響を与えることができます。

source: When sending `Messages`, you can add an instance of `OutgoingAmqpMetadata` to influence how the message is going to be sent to AMQP. For example, you can configure the subjects, properties:
ja_jp: `Messages` を送信するときに、 `OutgoingAmqpMetadata` のインスタンスを追加して、メッセージが AMQP に送信される方法に影響を与えることができます。たとえば、サブジェクト、プロパティーを設定できます。

source: When sending `Messages`, you can add an instance of `OutgoingRabbitMQMetadata` to influence how the message is handled by RabbitMQ. For example, you can configure the routing key, timestamp and headers:
ja_jp: `Messages` を送信するときに、 `OutgoingRabbitMQMetadata` のインスタンスを追加して、RabbitMQ によるメッセージの処理方法に影響を与えることができます。たとえば、ルーティングキー、タイムスタンプ、およびヘッダーを設定できます。

source: When sending a `Message<T>`, the connector converts the message into a RabbitMQ Message. The payload is converted to the RabbitMQ Message body.
ja_jp: `Message<T>` 送信時、コネクターはメッセージを RabbitMQ メッセージに変換します。ペイロードは RabbitMQ メッセージの本文に変換されます。

source: When sending a `Message<T>`, the connector converts the message into an AMQP Message. The payload is converted to the AMQP Message _body_.
ja_jp: `Message<T>` を送信するとき、コネクターはメッセージを AMQP Message に変換します。ペイロードは AMQP Message の _body_ に変換されます。

source: When sending multipart data that uses the same name, problems can arise if the client and server do not use the same multipart encoder mode. By default, the REST Client uses `RFC1738`, but depending on the situation, clients may need to be configured with `HTML5` or `RFC3986` mode.
ja_jp: 同じ名前を使用するマルチパートデータを送信する場合、クライアントとサーバーが同じマルチパートエンコーダーモードを使用していない場合、問題が発生する可能性があります。 デフォルトでは、REST Client は `RFC1738` を使用しますが、状況に応じて、クライアントを `HTML5` または `RFC3986` モードで設定する必要がある場合があります。

source: When sendingWhen sending a `Message<T>`, the connector converts the message into a RabbitMQ Message. The payload is converted to the RabbitMQ Message body.
ja_jp: `Message<T>` 送信時、コネクターはメッセージを RabbitMQ メッセージに変換します。ペイロードは RabbitMQ メッセージの本文に変換されます。

source: When serving multiple customers from the same application (e.g.: SaaS), each customer is a tenant. By enabling multi-tenancy support to your applications you are allowed to also support distinct authentication policies for each tenant even though if that means authenticating against different OpenID Providers, such as Keycloak and Google.
ja_jp: 同じアプリケーション (例: SaaS) から複数の顧客にサービスを提供する場合、各顧客はテナントです。アプリケーションに対してマルチテナンシーサポートを有効にすることで、Keycloak や Google などのさまざまな OpenID プロバイダーに対する認証であっても、テナントごとに異なる認証ポリシーをサポートできます。

source: When setting up the client programmatically using the `QuarkusRestClientBuilder`, the `ClientLogger` is set via the `clientLogger` method.
ja_jp: `QuarkusRestClientBuilder` を使用してプログラムでクライアントを設定する場合、 `ClientLogger` は `clientLogger` メソッドで設定されます。

source: When setting up your own login and registration endpoints, you don't need to enable the default endpoints, so you can remove the `quarkus.webauthn.enable-login-endpoint` and `quarkus.webauthn.enable-registration-endpoint` configuration.
ja_jp: 独自のログインおよび登録エンドポイントを設定する場合、デフォルトのエンドポイントを有効にする必要はありません。これにより、 `quarkus.webauthn.enable-login-endpoint` および `quarkus.webauthn.enable-registration-endpoint` 設定を削除できます。

source: When several path patterns correspond to the same request path, the system selects the longest sub-path leading to the `$$*$$` wildcard. In this context, every path segment character is more specific than the `$$*$$` wildcard.
ja_jp: 複数のパスパターンが同じリクエストパスに対応する場合、システムは `$$*$$` ワイルドカードにつながる最長のサブパスを選択します。 この文脈では、すべてのパスセグメント文字は、 `$$*$$` ワイルドカード よりも具体的になります。

source: When should you use a Gauge? Only if you can't use something else. Never gauge something you can count. Gauges can be less straight-forward to use than counters. If what you are measuring can be counted (because the value always increments), use a counter instead.
ja_jp: どんなときにゲージを使うべきでしょうか？他のものが使えない場合に限ります。カウンターが使えるものでゲージを使ってはいけません。ゲージはカウンターよりも使いにくい場合があります。測定しているものが数えられる場合（値が常に増加するため）は、代わりにカウンターを使用してください。

source: When should you use a counter? Use a counter if you are doing something that can not be either timed or summarized. If you want to understand more about how a value is changing, a timer (when the base unit of measurement is time) or a distribution summary might be more appropriate.
ja_jp: カウンターはいつ使用したらよいですか? 時間を計ったり要約したりできない作業の場合は、カウンターを使用します。 値がどのように変化しているかを詳しく知りたい場合は、 タイマー (測定の基本単位が時間の場合) またはディストリビューションサマリーの方が、 より適切な場合もあります。

source: When should you use a counter? Only if you are doing something that can not be either timed (or summarized). Counters only record a count, which may be all that is needed. However, if you want to understand more about how a value is changing, a timer (when the base unit of measurement is time) or a distribution summary might be more appropriate.
ja_jp: どんな時にカウンターを使うべきでしょうか？時間を計ることもまとめることもできないようなことをしているときだけです。カウンターはカウントを記録するだけなので、それだけで十分な場合もあります。しかし、値がどのように変化しているかをより深く理解したい場合は、タイマー（基本的な測定単位が時間の場合）やディストリビューション・サマリーの方が適切かもしれません。

source: When should you use a gauge? Only use a gauge when you can't use something else. Gauges can be less straight-forward to use than other meters. If what you are measuring can be counted (because the value always increments), use a counter instead.
ja_jp: ゲージはいつ使用したらよいですか? 他のものを使用できない場合にのみゲージを使用してください。 ゲージは他のメーターに比べて使い方が簡単ではない場合があります。 測定対象をカウントできる場合 (値が常に増加するため) は、代わりにカウンターを使用します。

source: When signing up new users, we can encrypt their password as follows:
ja_jp: 新規ユーザーを登録する際、以下のようにパスワードを暗号化することができます：

source: When starting Dev Services (for example, in tests or in DEV mode), you will see that the folder "/local/test/data" will be created at your file sytem and that will contain all the database data. When rerunning again the same dev services, this data will contain all the data you might have created beforehand.
ja_jp: devサービスを起動すると（テストやDEVモードなど）、ファイルシステムに "/local/test/data" フォルダが作成され、その中にすべてのデータベースデータが格納されることがわかります。同じdevサービスを再度実行する場合、このデータには、事前に作成したすべてのデータが含まれます。

source: When starting Dev Services (for example, in tests or in dev mode), you will see that the folder "/local/test/data" will be created at your file sytem and that will contain all the database data. When rerunning again the same Dev Services, this data will contain all the data you might have created beforehand.
ja_jp: Dev Services を起動すると (たとえばテストや開発モードで)、ファイルシステムに "/local/test/data" フォルダが作成され、そこにすべてのデータベースデータが格納されます。同じDev Servicesを再度実行する場合、このデータには事前に作成したすべてのデータが含まれます。

source: When starting a project, you choose the language, the build tool, the framework, then you add Dockerfiles, CI, dependencies and code.
ja_jp: プロジェクトを開始する際には、言語、ビルドツール、フレームワークを選択し、Dockerfile、CI、依存関係、コードを追加していきます。

source: When starting a project, you choose the language, the build tool, the framework, then you add dockerfiles, CI, dependencies and code.
ja_jp: プロジェクトを開始する際には、言語、ビルドツール、フレームワークを選択し、dockerfile、CI、依存関係、コードを追加していきます。

source: When starting dev mode (live reload), we are now able to automatically start containers for your tests and you don't even need to configure anything: the container is automatically wired to the Quarkus dev mode configuration.
ja_jp: 開発モードの起動（ライブリロード）時に、テスト用のコンテナを自動的に起動できるようになりました。何も設定する必要はありません。コンテナは自動的にQuarkusの開発モード設定と紐づけられます。

source: When starting the React app it will run on port 3000 by default. When we then try to access our Quarkus endpoint on port 8080 the browser will prevent this due to https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS[CORS security policies]. In production this will not matter as the compiled static React app will be served from Quarkus over port 8080 as well but during development this is an issue.
ja_jp: Reactアプリを起動すると、デフォルトではポート3000で実行されます。その後、ポート8080でQuarkusのエンドポイントにアクセスしようとすると、 link:https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS[CORSセキュリティポリシー]のためにブラウザがこれを阻止します。本番環境では、コンパイルされた静的なReactアプリがポート8080でQuarkusから提供されるため、これは問題になりませんが、開発中はこれが問題になります。

source: When subscribing to a topic using a regular expression, you can pick a certain type of topics. * **PersistentOnly**: only subscribe to persistent topics. + * **NonPersistentOnly**: only subscribe to non-persistent topics. + * **AllTopics**: subscribe to both persistent and non-persistent topics.
ja_jp: 正規表現を使ってトピックを購読する場合、特定の種類のトピックを選ぶことができます。

source: When targeting JDK 25+, you can instruct Quarkus to generate an AOT cache (`app.aot`) while running `@QuarkusIntegrationTest` tests. Enable this by adding the following system property to your integration test run:
ja_jp: JDK 25 以降をターゲットとする場合、 `@QuarkusIntegrationTest` テストの実行中に Quarkus に AOT キャッシュ (`app.aot`) を生成するように指示できます。これを有効にするには、統合テストの実行に次のシステムプロパティーを追加します。

source: When testing Quarkus security, ensure that your `IdentityProvider` is already set with usernames, passwords, and roles in `application.properties`. For more information about testing Quarkus Security, see xref:security-testing.adoc#configuring-user-information[Configuring user information].
ja_jp: Quarkusのセキュリティをテストする場合は、 `IdentityProvider` が、ユーザー名、パスワード、ロールが `application.properties` に設定されていることを確認してください。 Quarkusセキュリティのテストの詳細については、 xref:security-testing.adoc#configuring-user-information[ユーザー情報の設定] を参照してください。

source: When testing command line applications using `@QuarkusMain`, you can define the command line parameters in a `QuarkusTestProfile` by implementing `commandLineParameters()`.
ja_jp: `@QuarkusMain` を使用してコマンドラインアプリケーションをテストする場合、 `QuarkusTestProfile` で `commandLineParameters()` を実装することで、コマンドラインパラメータを定義することができます。

source: When testing or running in dev mode Quarkus can even provide you with a zero config database out of the box, a feature we refer to as Dev Services. Depending on your database type you may need Docker installed in order to use this feature.
ja_jp: Quarkusでは、テストや開発モードで実行する際に、ゼロコンフィグでデータベースをすぐに提供することができます。これは、私たちがDevServicesと呼ぶ機能です。データベースの種類によっては、この機能を使用するためにdockerをインストールする必要があります。DevServicesは以下のオープンソースデータベースでサポートされています。

source: When testing or running in dev mode Quarkus can even provide you with a zero config database out of the box, a feature we refer to as Dev Services. Depending on your database type you may need Docker installed in order to use this feature. Dev Services is supported for the following databases:
ja_jp: Quarkusは、テストや開発モードで実行する場合、ゼロコンフィグデータベースをすぐに提供することもできます。この機能をDev Servicesと呼んでいます。データベースの種類によっては、この機能を使用するためにDockerをインストールする必要があります。Dev Servicesは以下のデータベースに対応しています：

source: When testing or running in dev mode Quarkus can even provide you with a zero config database out of the box, a feature we refer to as Dev Services. More information can be found in the xref:datasource.adoc#dev-services[Datasource guide].
ja_jp: 開発モードでテストまたは実行する際に、Quarkus はゼロコンフィグのデータベースをすぐに提供できます。この機能を Dev Services と呼びます。詳細は xref:datasource.adoc#dev-services[データソースガイド] を参照してください。

source: When testing or running in dev mode Quarkus can even provide you with a zero config database out of the box, a feature we refer to as Dev Services. More information can be found xref:datasource.adoc#dev-services[here].
ja_jp: 開発モードでテストまたは実行する場合、Quarkus はゼロコンフィグのデータベースをすぐに提供することができますが、これはDev Servicesと呼ばれる機能です。詳細については、link:datasource.html#dev-services[こちら] をご覧ください。

source: When testing or running in dev mode Quarkus can provide you with a zero-config database out of the box, a feature we refer to as Dev Services.
ja_jp: 開発モードでテストまたは実行する場合、Quarkus は設定不要のデータベースをすぐに提供できます。これは、Dev Servicesと呼ばれる機能です。

source: When testing or running in dev mode Quarkus can provide you with a zero-config database out of the box, a feature we refer to as Dev Services. Depending on your database type you may need Docker installed in order to use this feature. Dev Services is supported for the following databases:
ja_jp: Quarkusでは、テストや開発モードで実行する際に、ゼロコンフィグでデータベースをすぐに提供することができます。これは、私たちがDevServicesと呼ぶ機能です。データベースの種類によっては、この機能を使用するためにDockerをインストールする必要があります。DevServicesは以下のデータベースでサポートされています。

source: When testing or running in dev-mode Quarkus can even provide you with a zero config database out of the box, a feature we refer to as Dev Services. More information can be found xref:datasource.adoc#dev-services[here].
ja_jp: 開発モードでテストまたは実行する場合、Quarkusはゼロコンフィグのデータベースをすぐに提供することができますが、これはDev Servicesと呼ばれる機能です。詳細については、 link:datasource.html#dev-services[こちら]をご覧ください。

source: When testing your application, you can inject the management URL using the `@TestHTTPResource` annotation:
ja_jp: アプリケーションをテストするときに、`@TestHTTPResource` アノテーションを使用して管理 URL を注入できます。

source: When that's not enough, you can always fall back to link:{hibernate-search-doc-prefix}#search-dsl-predicate-extensions-elasticsearch-from-json[defining a predicate using JSON directly].
ja_jp: それだけでは不十分な場合は、 link:{hibernate-search-doc-prefix}#search-dsl-predicate-extensions-elasticsearch-from-json[JSONを直接使う述語を定義] することもできます。

source: When that's not enough, you can always fall back to link:{hibernate-search-docs-url}#search-dsl-predicate-extensions-elasticsearch-from-json[defining a predicate using JSON directly].
ja_jp: それでも十分でない場合は、いつでも link:{hibernate-search-docs-url}#search-dsl-predicate-extensions-elasticsearch-from-json[JSONを直接使う述語の定義] にフォールバックできます。

source: When the Bearer tokens have to be verified then `quarkus-oidc`, `quarkus-smallrye-jwt` and `quarkus-elytron-security-oauth2` can be used.
ja_jp: ベアラートークンを検証する必要がある場合は、 `quarkus-oidc` 、 `quarkus-smallrye-jwt` 、 `quarkus-elytron-security-oauth2` を使用できます。

source: When the Factory is initializing, the provided `ConfigSourceContext` may call the method `ConfigValue getValue(String name)`. This method looks up configuration names in all ``ConfigSource``s that were already initialized by the `Config` instance, including sources with lower ordinals than the ones defined in the `ConfigSourceFactory`. The `ConfigSource` list provided by a `ConfigSourceFactory` is not taken into consideration to configure other sources produced by a lower priority `ConfigSourceFactory`.
ja_jp: ファクトリーの初期化中、提供された `ConfigSourceContext` は、メソッド `ConfigValue getValue(String name)` を呼び出すことができます。このメソッドは、 `Config` インスタンスによってすでに初期化されたすべての `ConfigSource` の設定名を検索します。これには、 `ConfigSourceFactory` で定義されたものよりも低い序列のソースが含まれます。 `ConfigSourceFactory` によって提供された `ConfigSource` リストは、優先順位の低い `ConfigSourceFactory` によって生成された他のソースを構成するためには考慮されません。

source: When the JWT token's signature must be verified, this token's key identifier (`kid`) header value is used to find a matching JWK key from the local verification public key set. However, since providers tend to periodically recycle signing key pairs and start signing newly issued tokens with new private keys, at some point the local key set may not have the matching public key to verify the current JWT. In this case, Quarkus attempts to refresh the verification key set, but blocks additional JWK key set refresh attempts for the `quarkus.oidc.token.forced-jwk-refresh-interval` period of time, to minimize the risk of many random tokens causing too many remote JWK set refresh attempts.
ja_jp: JWT トークンの署名を検証する必要がある場合、そのトークンのキー識別子 (`kid`) ヘッダー値を使用して、ローカルの検証用公開鍵セットから一致する JWK キーを検索します。しかし、プロバイダーは定期的に署名鍵ペアをリサイクルし、新たに発行するトークンに新しい秘密鍵で署名し始める傾向があるため、ある時点でローカルの鍵セットに現在の JWT を検証するための一致する公開鍵がなくなる可能性があります。この場合、Quarkus は検証キーセットの更新を試みますが、ランダムなトークンの大量送信によってリモートへの JWK セット更新リクエストが過剰に発生するリスクを最小限に抑えるため、`quarkus.oidc.token.forced-jwk-refresh-interval` で指定された期間は追加の JWK キーセット更新試行をブロックします。

source: When the Kafka producer receives an error from the server, if it is a transient, recoverable error, the client will retry sending the batch of messages. This behavior is controlled by `retries` and `retry.backoff.ms` parameters. In addition to this, SmallRye Reactive Messaging will retry individual messages on recoverable errors, depending on the `retries` and `delivery.timeout.ms` parameters.
ja_jp: Kafka プロデューサーがサーバーからエラーを受信した場合、それが一時的な回復可能なエラーである場合、クライアントはメッセージのバッチの送信を再試行します。この動作は、 `retries` および `retry.backoff.ms` パラメーターによって制御されます。これに加えて、SmallRye Reactive Messaging は、 `retries` および `delivery.timeout.ms` パラメーターに応じて、回復可能なエラーで個々のメッセージを再試行します。

source: When the Let's Encrypt certificate chain and private key have been successfully acquired, they are converted to PEM format and copied to your application's `.letsencrypt` folder. The TLS registry is informed that a new certificate and private key are ready and reloads them automatically.
ja_jp: Let's Encrypt 証明書チェーンと秘密鍵が正常に取得されると、それらは PEM フォーマットに変換され、アプリケーションの `.letsencrypt` フォルダーにコピーされます。 TLS レジストリーには、新しい証明書と秘密鍵の準備ができたことが通知され、それらの自動リロードが実行されます。

source: When the Maven invocation completes, you can inspect the generated configuration in the `target/native-image-agent-final-config` folder:
ja_jp: Maven の呼び出しが完了すると、 `target/native-image-agent-final-config` フォルダーで生成された設定を検査できます。

source: When the Micrometer extension is present, Quarkus can collect metrics for messages, errors and bytes transferred. If you require a WebSocket metrics, you can enable the metrics like in the example below:
ja_jp: Micrometer エクステンションが存在する場合、Quarkus はメッセージ、エラー、転送されたバイトのメトリクスを収集できます。 WebSocket メトリクスが必要な場合は、次の例のようにメトリクスを有効化できます。

source: When the OpenTelemetry extension is present, traces for opened and closed WebSocket connections are collected by default. If you do not require WebSocket traces, you can disable collecting of traces like in the example below:
ja_jp: OpenTelemetry エクステンションが存在する場合、開かれた WebSocket 接続と閉じられた WebSocket 接続のトレースがデフォルトで収集されます。 WebSocket トレースが必要ない場合は、次の例のようにトレースの収集を無効化できます。

source: When the Parent Profile is active, if a property cannot be found in the current active Profile, the config lookup fallbacks to the Parent Profile. Consider:
ja_jp: 親プロファイルがアクティブなときに、現在アクティブなプロファイルにプロパティーが見つからない場合、設定ルックアップは親プロファイルにフォールバックします。以下の例を考えてみます。

source: When the Quarkus dev tools Maven resolver is initialized, the relevant Maven mirrors and proxies found in the user `settings.xml` are automatically applied to the <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository configuration, as if the <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository was configured in the user `settings.xml`.
ja_jp: Quarkus dev toolsのMavenリゾルバが初期化されると、ユーザー `settings.xml` の関連するMavenミラーとプロキシは、あたかも <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Mavenリポジトリがユーザー `settings.xml` で構成されているかのように、自動的に <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Mavenリポジトリ設定に適用されます。

source: When the Quarkus dev tools Maven resolver is initialized, the relevant Maven mirrors and proxies found in the user `settings.xml` are automatically applied to the xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven repository configuration, as if the xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven repository was configured in the user `settings.xml`.
ja_jp: Quarkus開発ツールMaven resolverが初期化されると、関連するMavenミラーとプロキシは、ユーザー `settings.xml` で xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Mavenリポジトリが構成されていたかのように、自動的に xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Mavenリポジトリ構成に適応します。

source: When the Quarkus dev tools are initialized, this repository configuration is automatically added to the Maven resolver which will be used to resolve the platform and extension catalogs from <<registry.quarkus.io,registry.quarkus.io>>.
ja_jp: Quarkus開発ツールが初期化されると、このリポジトリ設定が自動的にMavenリゾルバに追加され、 <<registry.quarkus.io,registry.quarkus.io>> からのプラットフォームおよびエクステンションカタログの解決に使用されます。

source: When the Quarkus dev tools are initialized, this repository configuration is automatically added to the Maven resolver which will be used to resolve the platform and extension catalogs from xref:registry.quarkus.io[registry.quarkus.io].
ja_jp: Quarkus開発ツールが初期化されると、このリポジトリ設定がMavenリゾルバに自動的に追加され、 xref:registry.quarkus.io[registry.quarkus.io] からプラットフォームとエクステンションのカタログを解決するために使用されます。

source: When the Quarkus dev tools are launched, a search for the registry client configuration file is performed following these steps:
ja_jp: Quarkus開発ツールを起動すると、以下の手順でレジストリクライアント設定ファイルの検索が行われます:

source: When the RSS is higher in one native version of the application versus another, the following checks should be carried out first:
ja_jp: ネイティブバージョンで、あるアプリケーションが別のアプリケーションと比較しRSSが高くなる場合、まず以下のチェックを行う必要があります:
